app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "user@example.com"]]
---
	def token
			authenticate_with_http_basic do |email, password|
				user = User.find_by(email: email)